Revit 2024 API
ParameterTypeId.StairsSupportVerticalOffset Property
 "Vertical Offset": Distance of top plane of edge stringer relative to the plane connecting tread nosing
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StairsSupportVerticalOffset { get; }
Visual Basic
Public Shared ReadOnly Property StairsSupportVerticalOffset As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StairsSupportVerticalOffset {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace